numbers = {
            1:'A',
            2:'B',
            3:'Γ',
            4:'Δ',
            5:'Ε',
            6:'ΣΤ',
            7:'Ζ',
            8:'Η',
            9:'Θ',

            10:'Ι',
            20:'Κ',
            30:'Λ',
            40:'Μ',
            50:'Ν',
            60:'Ξ',
            70:'Ο',
            80:'Π',
            
            100:'Ρ',
            200:'Σ',
            300:'Τ',
            400:'Υ',
            500:'Φ',
            600:'Χ',
            700:'Ψ',
            800:'Ω'
             }

num = list(input('Number: '))
word = []

for i in range(len(num)):
    word.append(numbers[int(num[i])])

print(''.join(word))
